In [1]:
import pandas as pd
import numpy as np

In [2]:
loc= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\'

St1= pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'jan 2012')
St1.head()

         Time  Temperature
0  2012-01-01           26
1  2012-01-02           25
2  2012-01-03           25
3  2012-01-04           26
4  2012-01-05           25

In [3]:
St2 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Feb 2012')

In [4]:
St3 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'March')

In [5]:
St4 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'April')

In [6]:
St5 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'May')

In [7]:
St6 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'June')

In [8]:
St7 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'July')

In [9]:
St8 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Aug')

In [10]:
St9 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Sept')

In [11]:
St10 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Oct')

In [12]:
St11 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Nov')

In [13]:
St12 = pd.read_excel(loc + 'Tempdata2012.xlsx', sheet_name= 'Dec')

In [14]:
from functools import reduce

#define list of DataFrames
dfs = [St1, St2,St3,St4,St5,St6,St7,St8,St9,St10,St11,St12 ]

#merge all DataFrames into one
final_df = reduce(lambda  left,right: pd.merge(left,right,on=['Time', 'Temperature'],
                                            how='outer'), dfs)

In [15]:
final_df.tail()

           Time  Temperature
361  2012-12-27           21
362  2012-12-28           22
363  2012-12-29           24
364  2012-12-30           26
365  2012-12-31           27

### 2013-2014

In [16]:
St1= pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Jan 2013')
St2 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Feb')
St3 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'March')
St4 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'April')
St5 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'May')
St6 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'June')
St7 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'July')
St8 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Aug')
St9 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Sept')
St10 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Oct')
St11 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Nov')
St12 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Dec')
St13 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Jan 2014')
St14 = pd.read_excel(loc + 'Tempdata2013-14.xlsx', sheet_name= 'Feb 2014')

In [17]:
from functools import reduce

#define list of DataFrames
df2 = [St1, St2,St3,St4,St5,St6,St7,St8,St9,St10,St11,St12,St13,St14 ]

#merge all DataFrames into one
final_df2 = reduce(lambda  left,right: pd.merge(left,right,on=['Time', 'Temperature'],
                                            how='outer'), df2)

In [18]:
final_df2

           Time  Temperature
0    2013-01-01           29
1    2013-01-02           27
2    2013-01-03           27
3    2013-01-04           28
4    2013-01-05           26
..          ...          ...
419  2014-02-24           29
420  2014-02-25           29
421  2014-02-26           29
422  2014-02-27           29
423  2014-02-28           26

[424 rows x 2 columns]

In [19]:
Temp_data = pd.merge(final_df, final_df2, on=['Time', 'Temperature'], how='outer')

In [20]:
Temp_data

           Time  Temperature
0    2012-01-01           26
1    2012-01-02           25
2    2012-01-03           25
3    2012-01-04           26
4    2012-01-05           25
..          ...          ...
785  2014-02-24           29
786  2014-02-25           29
787  2014-02-26           29
788  2014-02-27           29
789  2014-02-28           26

[790 rows x 2 columns]

In [22]:
Temp_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 790 entries, 0 to 789
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Time         790 non-null    object
 1   Temperature  790 non-null    int64
dtypes: int64(1), object(1)
memory usage: 18.5+ KB

In [27]:
Temp_data= Temp_data.rename(columns= {'Time': 'date'})

In [28]:
Temp_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 790 entries, 0 to 789
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         790 non-null    object
 1   Temperature  790 non-null    int64
dtypes: int64(1), object(1)
memory usage: 18.5+ KB

In [ ]:
#out= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\Costco\\Dataset\\'

#Temp_data.to_excel( out + 'Temperature_data_daily.xlsx')

In [ ]:
#Temp_data['Time'] = Temp_data['Time'].astype('datetime64[ns]')

In [ ]:
#Temp_data.info()

In [ ]:
##setting "Date" column as index.
#Temp_data.set_index('Time', inplace=True)

##using resample() to convert to weekly data
#Temp_data1 =Temp_data.resample('w').mean()

In [ ]:
#Temp_data1.reset_index()

In [ ]:
#Temp_data1.reset_index(inplace=True)

In [ ]:
#Temp_data1.info()

In [ ]:
#Temp_data1['Date']= Temp_data1['Time']

In [ ]:
#Temp_data1['Time']= pd.to_datetime(Temp_data1['Time'])
#Temp_data1['year_month']= Temp_data1['Time'].dt.to_period('M')

In [ ]:
#Temp_data1.head(10)

In [ ]:
#Temp_data1['Temperature'] = Temp_data1['Temperature'].round(decimals = 2)

In [ ]:
#Temp_data1

In [ ]:
#Temp_data1 = Temp_data1.drop(['Time'], axis=1)
#Temp_data1

In [ ]:
#Temp_data1.info()

In [ ]:
#Temp_data1['year_month'] =   Temp_data1['year_month'].astype(str)

In [ ]:
#Temp_data1.info()

In [ ]:
#out= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\Costco\\Dataset\\'

#Temp_data1.to_excel( out + 'Temperature_data.xlsx')

### Loading inventory data

In [24]:
loc= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\Costco\\Dataset\\Indian_retail_data\\'

#Loading Date to week id map

df1= pd.read_excel(loc + 'inventory_data_final.xlsx', sheet_name= 'Sheet1')
df1.head()

,date,product_identifier,department_identifier,category_of_product,outlet,state,sales,week_id,sell_price,year_month,net Sales
0,2012-01-01,74,11,others,111,Maharashtra,0,49,2.94,2012-01,0.00
1,2012-01-01,337,11,others,111,Maharashtra,1,49,7.44,2012-01,7.44
2,2012-01-01,423,12,others,111,Maharashtra,0,49,0.97,2012-01,0.00
3,2012-01-01,432,12,others,111,Maharashtra,0,49,4.97,2012-01,0.00
4,2012-01-01,581,21,fast_moving_consumer_goods,111,Maharashtra,0,49,4.88,2012-01,0.00

In [25]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395000 entries, 0 to 394999
Data columns (total 11 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   date                   395000 non-null  object
 1   product_identifier     395000 non-null  int64
 2   department_identifier  395000 non-null  int64
 3   category_of_product    395000 non-null  object
 4   outlet                 395000 non-null  int64
 5   state                  395000 non-null  object
 6   sales                  395000 non-null  int64
 7   week_id                395000 non-null  int64
 8   sell_price             395000 non-null  float64
 9   year_month             395000 non-null  object
 10  net Sales              395000 non-null  float64
dtypes: float64(2), int64(5), object(4)
memory usage: 33.1+ MB

In [ ]:
#changing year_month to time_period format

#df1['year_month'] = pd.to_datetime(df1['year_month'])
#df1['year_month'] = df1['year_month'].dt.to_period('M')

In [ ]:
#df1.info()

In [ ]:
#df1[['date', 'week_id']]

In [29]:
df2= df1[df1['state']=='Maharashtra']

In [30]:
df2

,date,product_identifier,department_identifier,category_of_product,outlet,state,sales,week_id,sell_price,year_month,net Sales
0,2012-01-01,74,11,others,111,Maharashtra,0,49,2.94,2012-01,0.00
1,2012-01-01,337,11,others,111,Maharashtra,1,49,7.44,2012-01,7.44
2,2012-01-01,423,12,others,111,Maharashtra,0,49,0.97,2012-01,0.00
3,2012-01-01,432,12,others,111,Maharashtra,0,49,4.97,2012-01,0.00
4,2012-01-01,581,21,fast_moving_consumer_goods,111,Maharashtra,0,49,4.88,2012-01,0.00
...,...,...,...,...,...,...,...,...,...,...,...
394695,2014-02-28,2932,33,drinks_and_food,114,Maharashtra,4,161,2.78,2014-02,11.12
394696,2014-02-28,2935,33,drinks_and_food,114,Maharashtra,0,161,0.20,2014-02,0.00
394697,2014-02-28,3004,33,drinks_and_food,114,Maharashtra,0,161,2.50,2014-02,0.00
394698,2014-02-28,3008,33,drinks_and_food,114,Maharashtra,2,161,1.98,2014-02,3.96
394699,2014-02-28,3021,33,drinks_and_food,114,Maharashtra,0,161,2.08,2014-02,0.00

In [31]:
data= pd.merge(df2,Temp_data, on=['date'], how='inner' )

In [32]:
data.head(10)

,date,product_identifier,department_identifier,category_of_product,outlet,state,sales,week_id,sell_price,year_month,net Sales,Temperature
0,2012-01-01,74,11,others,111,Maharashtra,0,49,2.94,2012-01,0.00,26
1,2012-01-01,337,11,others,111,Maharashtra,1,49,7.44,2012-01,7.44,26
2,2012-01-01,423,12,others,111,Maharashtra,0,49,0.97,2012-01,0.00,26
3,2012-01-01,432,12,others,111,Maharashtra,0,49,4.97,2012-01,0.00,26
4,2012-01-01,581,21,fast_moving_consumer_goods,111,Maharashtra,0,49,4.88,2012-01,0.00,26
5,2012-01-01,611,21,fast_moving_consumer_goods,111,Maharashtra,0,49,2.84,2012-01,0.00,26
6,2012-01-01,631,21,fast_moving_consumer_goods,111,Maharashtra,0,49,6.97,2012-01,0.00,26
7,2012-01-01,659,21,fast_moving_consumer_goods,111,Maharashtra,0,49,3.97,2012-01,0.00,26
8,2012-01-01,743,21,fast_moving_consumer_goods,111,Maharashtra,0,49,4.47,2012-01,0.00,26
9,2012-01-01,797,21,fast_moving_consumer_goods,111,Maharashtra,0,49,2.64,2012-01,0.00,26

In [33]:
data.shape

(158000, 12)

In [35]:
out= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\Costco\\Dataset\\'

data.to_excel( out + 'Inventory_with_Temp_data.xlsx', index=False)

In [ ]:
#out= 'C:\\Users\\Ramshankar\\OneDrive - iLink Systems Inc\\Documents\\Costco\\Dataset\\'

#Temp_data1.to_excel( out + 'Temp_data_final.xlsx')

In [ ]:
#sample test

In [ ]:
#st3= pd.merge(St1, St2, on=['Time', 'Temperature'], how='outer')

In [ ]:
#st3

In [ ]:
#st3['Time'] = st3['Time'].astype('datetime64[ns]')

In [ ]:
#st3.head()

In [ ]:
## With function